app/controllers/login_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."user_name" = $1 AND "users"."password" = $2 LIMIT $3  [["user_name", "tuyet"], ["password", "1234"], ["LIMIT", 1]]
---
  def check_login
    user = User.find_by(user_name: params[:user_name], password: params[:password])