app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("user_name", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_name", "tuyet"], ["password", "1234"], ["created_at", "2018-03-27 06:15:17.213135"], ["updated_at", "2018-03-27 06:15:17.213135"]]

  def create_json
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]